In [1]:
A3 <- read.csv("./Data/A3_opt.csv")
head(A3)
tail(A3)
class(A3)

  price mileage fuelType mpg  engineSize age Automatic Manual Semi_Auto
1 1490  101000  0        44.5 1.9        17  1         0      0
2 1975  104000  1        38.1 2.0        15  0         1      0
3 2490  152034  0        55.4 1.9        11  0         1      0
4 2795  104000  0        53.3 1.9        13  0         1      0
5 2895  106790  1        35.3 1.6        15  0         1      0
6 2995  117000  0        48.7 2.0        12  0         1      0

     price mileage fuelType mpg  engineSize age Automatic Manual Semi_Auto
1854 33950 6763    1        34.5 2          1   0         0      1
1855 33990  262    1        33.2 2          1   0         0      1
1856 33990 4290    1        34.9 2          1   0         0      1
1857 33990 6000    1        33.2 2          1   1         0      0
1858 33995 3243    1        34.5 2          1   0         0      1
1859 34000 2000    1        33.2 2          1   0         0      1

[1] "data.frame"

In [2]:
A3$fuelType <- ifelse(A3$fuelType==1,replace(A3$fuelType,A3$fuelType==1,"Diesel"),replace(A3$fuelType,A3$fuelType==0,"Petrol"))

In [3]:
A3$model <- rep("A3",nrow(A3))

In [4]:
library(dplyr)

Attaching package: ‘dplyr’

The following objects are masked from ‘package:stats’:

    filter, lag

The following objects are masked from ‘package:base’:

    intersect, setdiff, setequal, union

In [5]:
A3$transmission <- ifelse(A3$Automatic==1,"Automatic",ifelse(A3$Manual==1,"Manual","Semi_Auto"))

In [6]:
A3 <- A3[,-c(7,8,9)]

In [7]:
A3 <- A3[,c(7,1,8,2,3,6)]

In [8]:
subset(A3,age==0)

     model price transmission mileage fuelType age

In [9]:
head(A3)

  model price transmission mileage fuelType age
1 A3    1490  Automatic    101000  Petrol   17
2 A3    1975  Manual       104000  Diesel   15
3 A3    2490  Manual       152034  Petrol   11
4 A3    2795  Manual       104000  Petrol   13
5 A3    2895  Manual       106790  Diesel   15
6 A3    2995  Manual       117000  Petrol   12

In [10]:
Q3 <- read.csv("./Data/Q3_opt.csv")

In [11]:
head(Q3)
tail(Q3)

  price mileage fuelType mpg  engineSize age Automatic Manual Semi_Auto
1 8750   67727  0        54.3 2          7   0         1      0
2 8900   90020  0        49.6 2          7   0         1      0
3 8975   77120  0        54.3 2          7   0         1      0
4 8995   73441  0        54.3 2          7   0         1      0
5 9000  108220  0        54.3 2          7   0         1      0
6 9250   88445  0        49.6 2          7   0         1      0

     price mileage fuelType mpg  engineSize age Automatic Manual Semi_Auto
1404 39888 1765    1        31.0 2          0   0         0      1
1405 39945 1000    1        31.4 2          1   1         0      0
1406 39990 3009    1        31.0 2          1   0         0      1
1407 39990 7120    1        31.4 2          1   0         0      1
1408 39990 7561    1        30.7 2          1   0         0      1
1409 39995 3000    1        30.7 2          0   0         0      1

In [12]:
Q3$fuelType <- ifelse(Q3$fuelType==1,replace(Q3$fuelType,Q3$fuelType==1,"Diesel"),replace(Q3$fuelType,Q3$fuelType==0,"Petrol"))

In [13]:
Q3$model <- rep("Q3",nrow(Q3))

In [14]:
Q3$transmission <- ifelse(Q3$Automatic==1,"Automatic",ifelse(Q3$Manual==1,"Manual","Semi_Auto"))

In [15]:
Q3 <- Q3[,-c(7,8,9)]

In [16]:
Q3 <- Q3[,c(7,1,8,2,3,6)]

In [17]:
Q3 <- subset(Q3,!age==0)

In [18]:
head(Q3)
tail(Q3)

  model price transmission mileage fuelType age
1 Q3    8750  Manual        67727  Petrol   7
2 Q3    8900  Manual        90020  Petrol   7
3 Q3    8975  Manual        77120  Petrol   7
4 Q3    8995  Manual        73441  Petrol   7
5 Q3    9000  Manual       108220  Petrol   7
6 Q3    9250  Manual        88445  Petrol   7

     model price transmission mileage fuelType age
1400 Q3    38995 Semi_Auto    5454    Diesel   1
1402 Q3    39490 Automatic    5000    Diesel   1
1405 Q3    39945 Automatic    1000    Diesel   1
1406 Q3    39990 Semi_Auto    3009    Diesel   1
1407 Q3    39990 Semi_Auto    7120    Diesel   1
1408 Q3    39990 Semi_Auto    7561    Diesel   1

In [19]:
A4 <- read.csv("./Data/A4_opt.csv")

In [20]:
head(A4)
tail(A4)

  price mileage fuelType mpg  engineSize age Automatic Manual Semi_Auto
1 2675  125000  1        34.9 2.0        13  0         1      0
2 2990   95000  1        34.9 2.0        15  0         1      0
3 2995  114000  0        48.7 2.0        14  0         1      0
4 3195  123000  1        33.6 1.8        15  0         1      0
5 3495  138649  0        33.2 2.0        13  0         1      0
6 3495  105000  1        34.0 2.0        14  1         0      0

     price mileage fuelType mpg  engineSize age Automatic Manual Semi_Auto
1374 46888 3988    0        39.2 3          1   1         0      0
1375 47000 6760    0        39.2 3          0   1         0      0
1376 47950 3558    0        39.2 3          0   1         0      0
1377 47990 5000    0        39.2 3          0   0         0      1
1378 47990 5500    1        35.3 2          0   1         0      0
1379 49000   38    0        39.2 3          0   1         0      0

In [21]:
A4$fuelType <- ifelse(A4$fuelType==1,replace(A4$fuelType,A4$fuelType==1,"Diesel"),replace(A4$fuelType,A4$fuelType==0,"Petrol"))

In [22]:
A4$model <- rep("A4",nrow(A4))

In [23]:
A4$transmission <- ifelse(A4$Automatic==1,"Automatic",ifelse(A4$Manual==1,"Manual","Semi_Auto"))

In [24]:
A4 <- A4[,-c(7,8,9)]

In [25]:
A4 <- A4[,c(7,1,8,2,3,6)]

In [26]:
A4 <- subset(A4,!age==0)

In [27]:
head(A4)
tail(A4)

  model price transmission mileage fuelType age
1 A4    2675  Manual       125000  Diesel   13
2 A4    2990  Manual        95000  Diesel   15
3 A4    2995  Manual       114000  Petrol   14
4 A4    3195  Manual       123000  Diesel   15
5 A4    3495  Manual       138649  Petrol   13
6 A4    3495  Automatic    105000  Diesel   14

     model price transmission mileage fuelType age
1366 A4    45490 Automatic    5500    Petrol   1
1368 A4    45950 Semi_Auto    3500    Petrol   1
1370 A4    45990 Automatic    5000    Petrol   1
1371 A4    46450 Automatic    2000    Petrol   1
1372 A4    46490 Automatic    5000    Petrol   1
1374 A4    46888 Automatic    3988    Petrol   1

In [29]:
audi_opt <- rbind(A3,Q3,A4)

In [33]:
rownames(audi_opt) <- c()

In [36]:
head(audi_opt)
tail(audi_opt)
nrow(audi_opt)

  model price transmission mileage fuelType age
1 A3    1490  Automatic    101000  Petrol   17
2 A3    1975  Manual       104000  Diesel   15
3 A3    2490  Manual       152034  Petrol   11
4 A3    2795  Manual       104000  Petrol   13
5 A3    2895  Manual       106790  Diesel   15
6 A3    2995  Manual       117000  Petrol   12

     model price transmission mileage fuelType age
4417 A4    45490 Automatic    5500    Petrol   1
4418 A4    45950 Semi_Auto    3500    Petrol   1
4419 A4    45990 Automatic    5000    Petrol   1
4420 A4    46450 Automatic    2000    Petrol   1
4421 A4    46490 Automatic    5000    Petrol   1
4422 A4    46888 Automatic    3988    Petrol   1

[1] 4422

In [38]:
write.csv(audi_opt,"./Data/audi_opt.csv",row.names=F)